#tap homebrew/cask-cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

tap 'discoteq/discoteq'
#tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/core'
#tap 'homebrew/dupes'
#tap 'homebrew/games'
#tap 'homebrew/gui'
#tap 'homebrew/nginx'
#tap 'homebrew/science'
#tap 'homebrew/tex'
#tap 'homebrew/versions'
#tap 'homebrew/x11'

brew 'asciinema'
brew 'bat'
brew 'binutils'
brew 'coreutils'
brew 'ctags'
brew 'curl'
brew 'dhcpdump'
brew 'dhcping'
brew 'diff-so-fancy'
brew 'docker'
brew 'docker-compose'
brew 'findutils'
brew 'gifify'
brew 'gifsicle'
brew 'git'
brew 'git'
brew 'git-cola'
brew 'git-extras'
brew 'git-flow'
brew 'git-lfs'
brew 'gnu-sed'
brew 'gnupg2'
brew 'grep'
brew 'grep'
brew 'htop-osx'
brew 'httperf'
brew 'httpie'
brew 'hub'
brew 'hub'
brew 'hub'
brew 'icdiff'
brew 'ifstat'
brew 'iftop'
brew 'iperf'
brew 'irssi'
brew 'lolcat'
brew 'node'
brew 'nvm'
brew 'parallel'
brew 'pidof'
brew 'pigz'
brew 'pkg-config'
brew 'pv'
brew 'pwgen'
brew 'ripgrep'
brew 'ripgrep'
brew 'sloccount'
brew 'speedtest_cli'
brew 'ssh-copy-id'
brew 'tcpflow'
brew 'terraform'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'tree'
brew 'unrar'
brew 'vim'
#, args: ["with-python3"]
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'
brew 'rbenv'
brew 'awscli'
brew 'github/gh/gh'

cask 'aws-vault'
# automatic tiling
cask 'amethyst'
cask 'brave-browser'
cask 'docker'
cask 'github'
cask 'iterm2'
#cask 'google-chrome'
cask 'gpg-suite'
# tiling shortcuts
cask 'spectacle'
#cask 'slack'
cask 'sublime-text'

cask 'font-liberation-mono-for-powerline'
cask 'font-ubuntu-nerd-font'
cask 'font-ubuntumono-nerd-font'

brew 'golang'
brew 'git-extras'
brew 'oath-toolkit'
brew 'nyancat'
brew 'tig'
brew 'pass'
brew 'xdot'
brew 'rust'

cask 'miniconda'
cask 'julia'
cask 'dropbox'
cask 'keeweb'
#cask 'mendeley-desktop'
#cask 'virtualbox'

brew 'magic-wormhole'

brew 'p7zip'

cask 'vagrant'

brew 'pyenv'
