#tap homebrew/cask-cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

tap 'discoteq/discoteq'
#tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/core'
#tap 'homebrew/dupes'
#tap 'homebrew/games'
#tap 'homebrew/gui'
#tap 'homebrew/nginx'
#tap 'homebrew/science'
#tap 'homebrew/tex'
#tap 'homebrew/versions'
#tap 'homebrew/x11'
tap 'TylerBrock/saw'

# automatic tiling
# tiling shortcuts
#, args: ["with-python3"]
brew 'asciinema'
brew 'bat'
brew 'binutils'
brew 'coreutils'
brew 'ctags'
brew 'the_silver_searcher'
brew 'curl'
brew 'dhcpdump'
brew 'dhcping'
brew 'diff-so-fancy'
brew 'findutils'
brew 'gifify'
brew 'gifsicle'
brew 'git'
brew 'git-cola'
brew 'git-extras'
brew 'git-flow'
brew 'git-lfs'
brew 'github/gh/gh'
brew 'gnu-sed'
brew 'gnupg2'
brew 'goenv'
brew 'grep'
brew 'grip'
brew 'htop-osx'
brew 'httperf'
brew 'httpie'
brew 'icdiff'
brew 'ifstat'
brew 'iftop'
brew 'iperf'
brew 'irssi'
brew 'lolcat'
brew 'magic-wormhole'
brew 'nvm'
brew 'nyancat'
brew 'oath-toolkit'
brew 'p7zip'
brew 'parallel'
brew 'pass'
brew 'pidof'
brew 'pigz'
brew 'pipx'
brew 'pkg-config'
brew 'pv'
brew 'pwgen'
brew 'pyenv'
brew 'rbenv'
brew 'ripgrep'
brew 'rust'
brew 'saw'
brew 'sloccount'
brew 'speedtest_cli'
brew 'ssh-copy-id'
brew 'tcpflow'
brew 'tfenv'
brew 'thefuck'
brew 'tig'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'xdot'
brew 'zsh'

cask 'aws-vault'
cask 'brave-browser'
cask 'cheatsheet'
cask 'docker'
cask 'dropbox'
cask 'font-liberation-mono-for-powerline'
cask 'font-meslo-for-powerline'
cask 'font-meslo-lg'
cask 'font-meslolg-nerd-font'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'
cask 'iina'
cask 'iterm2'
cask 'julia'
cask 'keeweb'
cask 'keka'
cask 'numi'
cask 'postman'
cask 'private-internet-access'
cask 'rectangle'
cask 'skitch'
cask 'slack'
cask 'sublime-text'
cask 'trailer'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
