tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'discoteq/discoteq'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/games'
tap 'homebrew/gui'
tap 'homebrew/nginx'
tap 'homebrew/science'
tap 'homebrew/tex'
tap 'homebrew/versions'
tap 'homebrew/x11'
brew 'asciinema'
brew 'gifsicle'
brew 'git'
brew 'asciinema2gif'
brew 'binutils'
brew 'coreutils'
brew 'ctags'
brew 'curl', args: ['with-c-ares', 'with-nghttp2']
brew 'dhcpdump'
brew 'dhcping'
brew 'docker-compose'
brew 'findutils'
brew 'gifify'
brew 'git-cola'
brew 'git-extras'
brew 'git-flow'
brew 'git-lfs'
brew 'gnu-sed'
brew 'grep'
brew 'htop-osx'
brew 'httperf'
brew 'hub'
brew 'icdiff'
brew 'ifstat'
brew 'iftop'
brew 'iperf'
brew 'irssi'
brew 'lolcat'
brew 'parallel'
brew 'pidof'
brew 'pigz'
brew 'pv'
brew 'pwgen'
brew 'ripgrep'
brew 'speedtest_cli'
brew 'ssh-copy-id'
brew 'tcpflow'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'vim', args: ['with-custom-ruby', 'with-python3']
brew 'watch'
brew 'wget'
brew 'zsh'
